### taps ###

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "xcodesorg/made"

### brew ###

brew "aria2"
brew "autojump"
brew "fd"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "icdiff"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "ripgrep"
brew "shellcheck"
brew "swiftformat" if system "/bin/test -d /Applications/Xcode.app"
brew "swiftlint" if system "/bin/test -d /Applications/Xcode.app"
brew "tldr"
brew "trash"
brew "xcodes"

# for create-dmg
brew "graphicsmagick"
brew "imagemagick"

### cask ###

# cask "istat-menus"
# cask "local"
# cask "meetingbar"
# cask "notion"
cask "appcleaner"
cask "betterzip"
cask "contexts"
cask "dash"
cask "dropbox"
cask "figma"
cask "font-input"
cask "font-symbols-only-nerd-font"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "launchbar"
cask "macdown"
cask "qlmarkdown"
cask "qlvideo"
cask "raycast"
cask "script-debugger"
cask "sf-symbols"
cask "spotify"
cask "swiftdefaultappsprefpane", cask_args: ["no-quarantine"]
cask "syntax-highlight", cask_args: ["no-quarantine"]
cask "transmit"
cask "ui-browser"
cask "visual-studio-code"

### mas ###

mas "Developer", id: 640199958
mas "Hush", id: 1544743900
mas "Keynote", id: 409183694
mas "Milonchik", id: 1534607376
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Select Like A Boss For Safari", id: 1437310115
mas "Shareful", id: 1522267256
mas "Toggl Track", id: 1291898086
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 1147396723
mas "Wipr", id: 1320666476
