dropbox
1password
karabiner-elements
hammerspoon
launchbar
contexts
dash
default-folder-x
mysides
shifty
script-debugger
ui-browser
visual-studio-code
cardhop
sip
google-chrome
appcleaner
betterzip
beyond-compare
handbrake
toggl
iterm2
imageoptim
soulver
db-browser-for-sqlite
transmission
iina
namechanger
qlstephen
quicklook-json
qlcolorcode
qlmarkdown
qlplayground
qladdict
qlimagesize
qlvideo
ql-ansilove
epubquicklook
